tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_SEMC.h
#define SEMC_SRAMCR5_REL_MASK                    (0xF000000U)
#define SEMC_SRAMCR5_REL_SHIFT                   (24U)
/*! REL - RE low time */
#define SEMC_SRAMCR5_REL(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR5_REL_SHIFT)) & SEMC_SRAMCR5_REL_MASK)

#define SEMC_SRAMCR5_REH_MASK                    (0xF0000000U)
#define SEMC_SRAMCR5_REH_SHIFT                   (28U)
/*! REH - RE high time */
#define SEMC_SRAMCR5_REH(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR5_REH_SHIFT)) & SEMC_SRAMCR5_REH_MASK)
/*! @} */

/*! @name SRAMCR6 - SRAM Control Register 6 */
/*! @{ */

#define SEMC_SRAMCR6_WDS_MASK                    (0xFU)
#define SEMC_SRAMCR6_WDS_SHIFT                   (0U)
/*! WDS - Write Data setup time */
#define SEMC_SRAMCR6_WDS(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_WDS_SHIFT)) & SEMC_SRAMCR6_WDS_MASK)

#define SEMC_SRAMCR6_WDH_MASK                    (0xF0U)
#define SEMC_SRAMCR6_WDH_SHIFT                   (4U)
/*! WDH - Write Data hold time */
#define SEMC_SRAMCR6_WDH(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_WDH_SHIFT)) & SEMC_SRAMCR6_WDH_MASK)

#define SEMC_SRAMCR6_TA_MASK                     (0xF00U)
#define SEMC_SRAMCR6_TA_SHIFT                    (8U)
/*! TA - Turnaround time */
#define SEMC_SRAMCR6_TA(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_TA_SHIFT)) & SEMC_SRAMCR6_TA_MASK)

#define SEMC_SRAMCR6_AWDH_MASK                   (0xF000U)
#define SEMC_SRAMCR6_AWDH_SHIFT                  (12U)
/*! AWDH - Address to write data hold time */
#define SEMC_SRAMCR6_AWDH(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_AWDH_SHIFT)) & SEMC_SRAMCR6_AWDH_MASK)

#define SEMC_SRAMCR6_LC_MASK                     (0xF0000U)
#define SEMC_SRAMCR6_LC_SHIFT                    (16U)
/*! LC - Latency count */
#define SEMC_SRAMCR6_LC(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_LC_SHIFT)) & SEMC_SRAMCR6_LC_MASK)

#define SEMC_SRAMCR6_RD_MASK                     (0xF00000U)
#define SEMC_SRAMCR6_RD_SHIFT                    (20U)
/*! RD - Read time */
#define SEMC_SRAMCR6_RD(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_RD_SHIFT)) & SEMC_SRAMCR6_RD_MASK)

#define SEMC_SRAMCR6_CEITV_MASK                  (0xF000000U)
#define SEMC_SRAMCR6_CEITV_SHIFT                 (24U)
/*! CEITV - CE# interval time */
#define SEMC_SRAMCR6_CEITV(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_CEITV_SHIFT)) & SEMC_SRAMCR6_CEITV_MASK)

#define SEMC_SRAMCR6_RDH_MASK                    (0xF0000000U)
#define SEMC_SRAMCR6_RDH_SHIFT                   (28U)
/*! RDH - Read hold time */
#define SEMC_SRAMCR6_RDH(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_RDH_SHIFT)) & SEMC_SRAMCR6_RDH_MASK)
/*! @} */

/*! @name NDBD - NAND Buffer DATA Register */
/*! @{ */

#define SEMC_NDBD_DAT_MASK                       (0xFFFFFFFFU)
#define SEMC_NDBD_DAT_SHIFT                      (0U)
/*! DAT - NAND Buffer data. It is used for program or read operation from IPS bus. */
#define SEMC_NDBD_DAT(x)                         (((uint32_t)(((uint32_t)(x)) << SEMC_NDBD_DAT_SHIFT)) & SEMC_NDBD_DAT_MASK)
/*! @} */

/*! @name NDBA - NAND Buffer Address Register */
/*! @{ */

#define SEMC_NDBA_ADDR_MASK                      (0xFFFU)
#define SEMC_NDBA_ADDR_SHIFT                     (0U)
/*! ADDR - NAND Buffer address. It is used for program or read operation from IPS bus. It should be
 *    configured to proper value before access to NDBD register.
 */
#define SEMC_NDBA_ADDR(x)                        (((uint32_t)(((uint32_t)(x)) << SEMC_NDBA_ADDR_SHIFT)) & SEMC_NDBA_ADDR_MASK)
/*! @} */

/*! @name DCCR - Delay Chain Control Register */
/*! @{ */

#define SEMC_DCCR_SDRAMEN_MASK                   (0x1U)
#define SEMC_DCCR_SDRAMEN_SHIFT                  (0U)
/*! SDRAMEN - Delay chain insertion enable for SRAM device.
 *  0b0..Delay chain is not inserted.
 *  0b1..Delay chain is inserted.
 */
#define SEMC_DCCR_SDRAMEN(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_SDRAMEN_SHIFT)) & SEMC_DCCR_SDRAMEN_MASK)

#define SEMC_DCCR_SDRAMVAL_MASK                  (0x3EU)
#define SEMC_DCCR_SDRAMVAL_SHIFT                 (1U)
/*! SDRAMVAL - Clock delay line delay cell number selection value for SDRAM device. */
#define SEMC_DCCR_SDRAMVAL(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_SDRAMVAL_SHIFT)) & SEMC_DCCR_SDRAMVAL_MASK)

#define SEMC_DCCR_NOREN_MASK                     (0x100U)
#define SEMC_DCCR_NOREN_SHIFT                    (8U)
/*! NOREN - Delay chain insertion enable for NOR device.
 *  0b0..Delay chain is not inserted.
 *  0b1..Delay chain is inserted.
 */
#define SEMC_DCCR_NOREN(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_NOREN_SHIFT)) & SEMC_DCCR_NOREN_MASK)

#define SEMC_DCCR_NORVAL_MASK                    (0x3E00U)
#define SEMC_DCCR_NORVAL_SHIFT                   (9U)
/*! NORVAL - Clock delay line delay cell number selection value for NOR device. */
#define SEMC_DCCR_NORVAL(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_NORVAL_SHIFT)) & SEMC_DCCR_NORVAL_MASK)

#define SEMC_DCCR_SRAM0EN_MASK                   (0x10000U)
#define SEMC_DCCR_SRAM0EN_SHIFT                  (16U)
/*! SRAM0EN - Delay chain insertion enable for SRAM device 0.
 *  0b0..Delay chain is not inserted.
 *  0b1..Delay chain is inserted.
 */
#define SEMC_DCCR_SRAM0EN(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_SRAM0EN_SHIFT)) & SEMC_DCCR_SRAM0EN_MASK)

#define SEMC_DCCR_SRAM0VAL_MASK                  (0x3E0000U)
#define SEMC_DCCR_SRAM0VAL_SHIFT                 (17U)
/*! SRAM0VAL - Clock delay line delay cell number selection value for SRAM device 0. */
#define SEMC_DCCR_SRAM0VAL(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_SRAM0VAL_SHIFT)) & SEMC_DCCR_SRAM0VAL_MASK)

#define SEMC_DCCR_SRAMXEN_MASK                   (0x1000000U)
#define SEMC_DCCR_SRAMXEN_SHIFT                  (24U)
/*! SRAMXEN - Delay chain insertion enable for SRAM device 1-3.
 *  0b0..Delay chain is not inserted.
 *  0b1..Delay chain is inserted.
 */
#define SEMC_DCCR_SRAMXEN(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_SRAMXEN_SHIFT)) & SEMC_DCCR_SRAMXEN_MASK)

#define SEMC_DCCR_SRAMXVAL_MASK                  (0x3E000000U)
#define SEMC_DCCR_SRAMXVAL_SHIFT                 (25U)
/*! SRAMXVAL - Clock delay line delay cell number selection value for SRAM device 1-3. */
#define SEMC_DCCR_SRAMXVAL(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_DCCR_SRAMXVAL_SHIFT)) & SEMC_DCCR_SRAMXVAL_MASK)
/*! @} */

/*! @name SDRAMPCR - SDRAM Prefetch Control Register */
/*! @{ */

#define SEMC_SDRAMPCR_PREFETCH_EN_MASK           (0x1U)
#define SEMC_SDRAMPCR_PREFETCH_EN_SHIFT          (0U)
/*! PREFETCH_EN - SDRAM prefetch enable.
 *  0b0..SDRAM prefetch function is disabled.
 *  0b1..SDRAM prefetch function is enabled.
 */
#define SEMC_SDRAMPCR_PREFETCH_EN(x)             (((uint32_t)(((uint32_t)(x)) << SEMC_SDRAMPCR_PREFETCH_EN_SHIFT)) & SEMC_SDRAMPCR_PREFETCH_EN_MASK)

#define SEMC_SDRAMPCR_PREFETCH_DLY_MASK          (0xEU)
#define SEMC_SDRAMPCR_PREFETCH_DLY_SHIFT         (1U)
/*! PREFETCH_DLY - SDRAM prefetch delay cycle. */
#define SEMC_SDRAMPCR_PREFETCH_DLY(x)            (((uint32_t)(((uint32_t)(x)) << SEMC_SDRAMPCR_PREFETCH_DLY_SHIFT)) & SEMC_SDRAMPCR_PREFETCH_DLY_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SEMC_Register_Masks */


/*!
 * @}
 */ /* end of group SEMC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SEMC_H_ */

